<?php
/**
 * Created by PhpStorm.
 * User: ms
 * Date: 2018/8/19
 * Time: 16:04
 */

return [
    'reg' =>  [
        'tel_and_mobile' => '/^(0\d{2,3}-\d{7,8})|(1[3458]\d{9})$/',//手机支持13，14，15，18号段得
        'tel'            => '/^0\d{2,3}-\d{7,8}$/',
        'mobile'         => '/^1[3458]\d{9}$/',
        'number'         =>  '/^\d+$/',                   //自然数，0123456789
        'number_no_0'    =>  '/^[1-9](\d*)?$/',           //自然数，123456789
        'integer'        =>  '/^[-\+]?\d+$/',             //整数（正整数+负整数+0）
        'decimal'        => '/^[-\+]?\d+(\.\d+)?$/',      //正负浮点数
        'decimal2'       =>  '/^[-\+]?\d+(\.\d{1,2})?$/', //正负浮点数（最多两位小数得）
        'pos_decimal'    => '/^\d+(\.\d+)?$/',            //正浮点数
        'pos_decimal2'   => '/^\d+(\.\d{1,2})?$/',        //正浮点数（最多两位小数
    ]
];